Autodesk.Revit.DB.Structure.PointLoad.IsPointInsideHostBoundaries(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Indicates if the point is inside panel's boundaries or if the point is on the member's curve..
pDoc:
The document containing both the host and the load.
hostId:
The id of the analytical element that is about to host a point load.
point:
The position of point load, measured in decimal feet.
Returns:
True if a point load can be placed on the input host id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.PointLoad.IsValidHostId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if the provided host id can host point loads
The document containing both the host and the load
The id of the analytical element that is about to host a point load
True if a point load can be placed on the input host id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.PointLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.PointLoadType)
Creates a new custom hosted point load within the project using data at point.
document:
Document to which new point load will be added.
hostElemId:
The AnalyticalElement host element for the point Load.
point:
The position of point load, measured in decimal feet.
forceVector:
The applied 3d force vector.
momentVector:
The applied 3d moment vector.
symbol:
The symbol of the PointLoad. Set null to use default type.
Returns:
If successful, returns the newly created PointLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostElemId is not permitted for this type of load.
-or-
Thrown when work plane is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created point load.
Since:
2024

Autodesk.Revit.DB.Structure.PointLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.PointLoadType)
Creates a new hosted point load within the project.
document:
Document to which new point load will be added.
hostElemId:
The AnalyticalMember host element for the point Load.
selector:
The start or end point of the Analytical Member element.
forceVector:
The applied 3d force vector.
momentVector:
The applied 3d moment vector.
symbol:
The symbol of the PointLoad. Set null to use default type.
Returns:
If successful, returns the newly created PointLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElemId does not exist in the document
-or-
hostElemId is not permitted for this type of load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created point load.
Since:
2023

Autodesk.Revit.DB.Structure.PointLoad.MomentVector
The moment vector applied to the point load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN-m for metric, and kip-ft for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.PointLoad.ForceVector
The force vector applied to the point load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN for metric, and kip for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.PointLoad.Point
Returns the position of point load, measured in decimal feet.
Remarks:
Loacation can be set only for hosted loads.
This method works for loads which are not constrained to their host.
To determine if load is hosted use Autodesk.Revit.DB.Structure.LoadBase.IsHosted property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This PointLoad is not a hosted load.
-or-
When setting this property: This PointLoad is a constrained load.
Since:
2016

Autodesk.Revit.DB.Structure.PointLoad
An object that represents a force/moment applied to a single point.
Data members